README.org
#+TITLE: Space Engineers Social Relay Project Readme
#+AUTHOR: Raelon 'th3r00t' Masters
#+EMAIL: admin@mylt.dev
#+DATE: 2023-02-21
#+LANGUAGE: en
#+OPTIONS: toc:t ltoc:t num:nil
* Version 0.1.0-prerelease
* Introduction
Space Engineers Social Relay Project is a project to create a social relay
network for the game Space Engineers. The goal is to create a network of
relays that can be used to send information from connected servers back to a
centralized frontend.

Each relay will be a server that is connected to the game server and will be
able to send information back to the frontend. The frontend will be a web
application that will allow users to view information about the game servers
and their players.

This is just the beginning of the project specification, and further features
will be added as the project progresses.

* Howto
During the initial development phase, the project will be developed in a way
where the aggregated data will be stored in a local database. Conversly the
data being scraped is currently setup with a rsync driven file fetching system.

It is not expected that actual deployment of the relay post development will
be done in this manner, but it is a good way to get started. Seemingly as a
biproduct of this, the files being scraped are not the same as the files
in use by the game server. The work is being done on copies of the files.
Which should by virtue of rsync be guaranteed to be latest availavle version.

** TODO adjust rsync loop to guarantee no changes to the local files will be synced upstream.

* Current State
** Scraping
*** *DONE* /server settings./
*** *DONE* /player list/.
*** *DONE* /faction List/.
*** TODO player to faction link.
*** *DONE* /mod List/.
*** *DONE* /relative top speed settings/.
*** TODO crunch econ data.
*** TODO server grid list.
*** TODO link grids to players.
** Publishing
*** *DONE* /publish server settings/.
*** *DONE* /publish player list/.
*** *DONE* /publish faction List/.
*** TODO publish player to faction link.
*** *DONE* /publish mod List/.
*** TODO publish relative top speed settings.
*** TODO publish crunch econ data.
*** TODO publish server grid list.
*** TODO publish link grids to players.

* Project Goals
** DONE Scrape in-game information from servers sbc files
This will be completely decoupled from existing server tech, it will be its
own daemon that will run on the server and will be able to scrape the
information from the server's sbc files.
** Store results
*** DONE Put data in local sqlite database
*** TODO Send data to remote database
**** VERIFY Using sqlalchemy this should be as simple as updating the engine creation routine.
* Open Source
The relay is now, and will remain an opensource project. The source code is
hosted on [[https://github.com/th3r00t/sesocial-relay][github]]. The frontend is closed source, and will be hosted free for all to use
once it is ready for public use at [[https://spaceengineers.social/][(yourserver).spaceengineers.social].

With the relay being opensource, and since it does all the real work of interpreting the data others
are encouraged to contribute to the project. If you are interested in helping out, please contact
me on my discord server at [[https://discord.gg/H9TbNJS][discord.gg/H9TbNJS]].
